In [1]:
import numpy as np
import pandas as pd

In [ ]:
--- Merging 2 DataFrames ---

In [6]:
employees = pd.DataFrame({
    'employee_id': [1,2,3,4,5],
    'name': ['John', 'Anna', 'Peter', 'Linda', 'Bob'],
    'department': ['Hr', 'IT', 'Finance', 'IT', 'Hr']
})

# DataFrame 2 : Salary information
Salaries = pd.DataFrame({
    'employee_id': [1,2,3,6,7],
    'Salary': [60000, 80000, 45000, 67000, 78000],
    'bonus': [1000, 10000, 4500, 5000, 1200]
})

In [7]:
employees

   employee_id   name department
0            1   John         Hr
1            2   Anna         IT
2            3  Peter    Finance
3            4  Linda         IT
4            5    Bob         Hr

In [8]:
Salaries

   employee_id  Salary  bonus
0            1   60000   1000
1            2   80000  10000
2            3   45000   4500
3            6   67000   5000
4            7   78000   1200

In [9]:
pd.merge(employees, Salaries, on = 'employee_id', how = 'inner')

   employee_id   name department  Salary  bonus
0            1   John         Hr   60000   1000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   45000   4500

In [10]:
pd.merge(employees, Salaries, on = 'employee_id', how = 'outer')

   employee_id   name department   Salary    bonus
0            1   John         Hr  60000.0   1000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  45000.0   4500.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         Hr      NaN      NaN
5            6    NaN        NaN  67000.0   5000.0
6            7    NaN        NaN  78000.0   1200.0

In [12]:
pd.merge(employees, Salaries, on = 'employee_id', how = 'left')

   employee_id   name department   Salary    bonus
0            1   John         Hr  60000.0   1000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  45000.0   4500.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         Hr      NaN      NaN

In [13]:
pd.merge(employees, Salaries, on = 'employee_id', how = 'right')

   employee_id   name department  Salary  bonus
0            1   John         Hr   60000   1000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   45000   4500
3            6    NaN        NaN   67000   5000
4            7    NaN        NaN   78000   1200

In [ ]:
--- Concatination of 2 dataframes ---

In [18]:
df1 = pd.DataFrame ({
    'A':['A0', 'A1', 'A2'],
    'B':['B0', 'B1', 'B2'],
    'C':['C0', 'C1', 'C3']
})

df2 = pd.DataFrame ({
    'A':['A3', 'A4', 'A5'],
    'B':['B3', 'B4', 'B5'],
    'C':['C4', 'C4', 'C5']
})

In [20]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C3

In [21]:
df2

    A   B   C
0  A3  B3  C4
1  A4  B4  C4
2  A5  B5  C5

In [19]:
pd.concat([df1, df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C3
0  A3  B3  C4
1  A4  B4  C4
2  A5  B5  C5

In [22]:
pd.concat([df2,df1])

    A   B   C
0  A3  B3  C4
1  A4  B4  C4
2  A5  B5  C5
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C3

In [23]:
pd.concat([df1,df2], axis = 1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C4
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C3  A5  B5  C5

Joining of 2 dataframes

In [25]:
df1 = pd.DataFrame({
    'Name':['Alice', 'Bob', 'Charli']
}, index = [1,2,3])

# second Dataframes
df2 = pd.DataFrame({
    'Scores':[85,90,75]
}, index = [2,3,4])

In [27]:
df1

     Name
1   Alice
2     Bob
3  Charli

In [28]:
df2

   Scores
2      85
3      90
4      75

In [29]:
df1.join(df2)

     Name  Scores
1   Alice     NaN
2     Bob    85.0
3  Charli    90.0

In [30]:
df2.join(df1)

   Scores    Name
2      85     Bob
3      90  Charli
4      75     NaN

In [31]:
df1.join(df2, how = 'inner')

     Name  Scores
2     Bob      85
3  Charli      90

In [33]:
df1.join(df2, how = 'outer')

     Name  Scores
1   Alice     NaN
2     Bob    85.0
3  Charli    90.0
4     NaN    75.0

In [34]:
df1.join(df2, how = 'left')

     Name  Scores
1   Alice     NaN
2     Bob    85.0
3  Charli    90.0

In [35]:
df1.join(df2, how = 'right')

     Name  Scores
2     Bob      85
3  Charli      90
4     NaN      75